Tekla Open API Reference for Tekla Structures 2025
ProfileItem.IsProfileUserDefined Method
 Whether the profile is a fixed user-defined profile.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsProfileUserDefined()
Public Function IsProfileUserDefined As Boolean
Return Value
Type: Boolean
Whether the profile is a fixed user-defined profile or not.
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace